app/Http/Controllers/PostController.php

select * from `posts` order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `posts`
---
    public function index ()
    {
        $posts = Post::orderBy('created_at', 'DESC')->paginate(15);